![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 7.9 Descriptive Statistics with Dataframe

First we import pandas library

In [1]:
import pandas as pd

Here we read a dataframe from a csv file using the function **pd.read_csv()**:

In [2]:
wage  = pd.read_csv('data/wage.csv', index_col ='year')

We can display the head of this dataframe using the function **head()**:

In [3]:
wage.head()

      age        wage
year
2006   18   75.043154
2004   24   70.476020
2003   45  130.982177
2003   43  154.685293
2005   50   75.043154

We can apply descriptive statistics for columns such as the **sum** like this:

In [4]:
wage.sum()

age      839.000000
wage    2333.253017
dtype: float64

If we want to calculate statistics per rows, we use the argument **axis = 'columns'**:

In [5]:
wage.sum(axis ='columns')

year
2006     93.043154
2004     94.476020
2003    175.982177
2003    197.685293
2005    125.043154
2008    181.115744
2009    213.528538
2008    141.720849
2006    159.884359
2004    180.680488
2007    162.146817
2007    115.283253
2005    124.492480
2003    173.705375
2009    188.705375
2009    141.481913
2003    119.679637
2006    262.842352
2007    185.156693
2003    135.599344
dtype: float64

Thw minumum and the maximum can be calculated like this:

In [6]:
wage.min()

age     18.00000
wage    70.47602
dtype: float64

In [7]:
wage.max()

age      56.000000
wage    212.842352
dtype: float64

To display the index value for the minimum and the maximum we use the functions **idmax()** and **idmin()**:

In [8]:
wage.idxmax()

age     2007
wage    2006
dtype: int64

In [9]:
wage.idxmin()

age     2006
wage    2004
dtype: int64

Cumulative sum can be calculated using the function **cumsum()**:

In [10]:
wage.cumsum()

      age         wage
year
2006   18    75.043154
2004   42   145.519174
2003   87   276.501351
2003  130   431.186644
2005  180   506.229798
2008  234   633.345542
2009  278   802.874080
2008  308   914.594929
2006  349  1033.479289
2004  401  1162.159777
2007  446  1279.306594
2007  480  1360.589847
2005  515  1450.082326
2003  554  1584.787702
2009  608  1719.493077
2009  659  1809.974990
2003  696  1892.654627
2006  746  2105.496980
2007  802  2234.653673
2003  839  2333.253017

We can display a group of statistics using the function **describe()**:

In [11]:
wage.describe()

             age        wage
count  20.000000   20.000000
mean   41.950000  116.662651
std    10.343953   35.939001
min    18.000000   70.476020
25%    36.500000   87.789269
50%    43.500000  118.015588
75%    50.250000  131.912977
max    56.000000  212.842352

***

<h1 align="center">Thank You</h1> 

***